InformationRegisters/ЛБ_СтатусыНакладнойНаОтгрузку.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЛБ_СтатусыНакладнойНаОтгрузку</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>НомерНакладной</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаНакладной</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОтказОтВыкупа</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПовышеннаяОценка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтатусНакладной</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_СтатусыНакладнойНаОтгрузку</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоИзделий</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВесИзделий</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаОценки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Получатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Ломбарды</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкладПолучатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Инкассатор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
						<v8:Type>cfg:CatalogRef._ДемоКонтрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтветственныйСотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пустой</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтветственныйПользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>НакладнаяНаОтгрузку</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЛБ_НакладнаяНаОтгрузку</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

AccumulationRegisters/ЛБ_ОбъектыЗалогаПодлежащиеОтгрузке.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ЛБ_ОбъектыЗалогаПодлежащиеОтгрузке</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Вес</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаОценки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Ломбард</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Ломбарды</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НакладнаяНаОтгрузку</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЛБ_НакладнаяНаОтгрузку</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗалоговыйБилет</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЛБ_ОперацияПоЗалогу</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектЗалога</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_ОбъектыЗалога</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Enums/ЛБ_СтатусыНакладнойНаОтгрузку.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ЛБ_СтатусыНакладнойНаОтгрузку</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Проект</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Факт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СумкаОткрыта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СумкаЗакрыта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отгружена</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

CommonForms/ЛБ_ФормаОтменыОтгрузкиНакладных/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("Документ") Тогда
		Документ = Параметры.Документ; 
		Если Документ.Проведен тогда
		   СостояниеДокумента = 1;
		ИначеЕсли Документ.ПометкаУдаления тогда
		   СостояниеДокумента = 2;
        КонецЕсли;
		ЗаполнитьСписокНакладныхДокументу();
		ЗаполнитьТаблицу();
		Элементы.ГруппаДокумент.Видимость = Истина; 
		Элементы.ГруппаДокументПодвал.Видимость = Истина;   
		Элементы.ТаблицаВыбора.КоманднаяПанель.Видимость = Ложь;
		Элементы.ТаблицаВыбораВкл.Видимость = Ложь;  
		ЭтаФорма.Заголовок = Метаданные.Документы.ЛБ_КорректировкаНакладной.Синоним + ": " + Строка(Документ.ВидОперации);
	Иначе
		Если Параметры.Свойство("Организация") Тогда
			Организация = Параметры.Организация; 
		КонецЕсли;	
		Если Параметры.Свойство("Ломбард") Тогда
			Ломбард = Параметры.Ломбард; 
		КонецЕсли;    
		ЭтаФорма.Заголовок = "Отмена отгрузки накладных";
	КонецЕсли;	

КонецПроцедуры	

&НаСервере
Процедура ЗаполнитьСписокНакладныхДокументу()
	СписокНакладных.Очистить();
	Для каждого стр Из Документ.ЗалоговыеБилеты Цикл 
		Если СписокНакладных.НайтиПоЗначению(Стр.НакладнаяНаОтгрузку) = неопределено Тогда 
			СписокНакладных.Добавить(Стр.НакладнаяНаОтгрузку);
		КонецЕсли;	
	КонецЦикла;	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьНакладные(Команда)
	ПараметрыФормы = Новый Структура;
    ПараметрыФормы.Вставить("Организация", Организация); 
	ПараметрыФормы.Вставить("Ломбард", Ломбард); 
	ПараметрыФормы.Вставить("ВидОперации", 1);
	ОбработкаВыбора = Новый ОписаниеОповещения("ПослеВыбораНакладных", ЭтаФорма);
	ОткрытьФорму("ОбщаяФорма.ЛБ_ВыборНакладных", ПараметрыФормы ,,,,, ОбработкаВыбора, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры  

&НаСервере
Процедура ЗаполнитьТаблицу()
	Запрос = Новый Запрос; 
	Запрос.УстановитьПараметр("Список", СписокНакладных);
	Запрос.УстановитьПараметр("Дата", ?(ЗначениеЗаполнено(Документ), Документ.Дата-1, ТекущаяДатаСеанса())); 
	Запрос.Текст = "ВЫБРАТЬ
	               |	ИСТИНА КАК Вкл,
	               |	ЛБ_СтатусыНакладнойНаОтгрузкуСрезПоследних.НакладнаяНаОтгрузку КАК НакладнаяНаОтгрузку,
	               |	0 КАК КоличествоИзделий,
	               |	0 КАК ВесИзделий,
	               |	0 КАК СуммаОценки,
	               |	ЛБ_СтатусыНакладнойНаОтгрузкуСрезПоследних.СтатусНакладной КАК СтатусНакладной,
	               |	ЛБ_СтатусыНакладнойНаОтгрузкуСрезПоследних.Период КАК ДатаОтгрузки,
	               |	ЗНАЧЕНИЕ(Перечисление.ЛБ_статусыНакладнойНаОтгрузку.СумкаЗакрыта) КАК СтатусНакладнойНовый,
				   //+МАН 03.12.24 Добавлено для заполнения Ломбарда
	               |	ЛБ_СтатусыНакладнойНаОтгрузкуСрезПоследних.НакладнаяНаОтгрузку.Ломбард КАК Ломбард
				   //-МАН
	               |ИЗ
	               |	РегистрСведений.ЛБ_СтатусыНакладнойНаОтгрузку.СрезПоследних(&Дата, НакладнаяНаОтгрузку В (&Список)) КАК ЛБ_СтатусыНакладнойНаОтгрузкуСрезПоследних
	               |ГДЕ
	               |	ЛБ_СтатусыНакладнойНаОтгрузкуСрезПоследних.СтатусНакладной = ЗНАЧЕНИЕ(Перечисление.ЛБ_СтатусыНакладнойНаОтгрузку.Отгружена)"; 
  	ТаблицаЗапроса = Запрос.Выполнить().Выгрузить();   
		
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_ОбъектыЗалогаПодлежащиеОтгрузке.Период КАК Период,
	               |	ЛБ_ОбъектыЗалогаПодлежащиеОтгрузке.НакладнаяНаОтгрузку КАК НакладнаяНаОтгрузку,
	               |	СУММА(ЛБ_ОбъектыЗалогаПодлежащиеОтгрузке.Количество) КАК Количество,
	               |	СУММА(ЛБ_ОбъектыЗалогаПодлежащиеОтгрузке.Вес) КАК Вес,
	               |	СУММА(ЛБ_ОбъектыЗалогаПодлежащиеОтгрузке.СуммаОценки) КАК СуммаОценки
	               |ИЗ
	               |	РегистрНакопления.ЛБ_ОбъектыЗалогаПодлежащиеОтгрузке КАК ЛБ_ОбъектыЗалогаПодлежащиеОтгрузке
	               |ГДЕ
	               |	ЛБ_ОбъектыЗалогаПодлежащиеОтгрузке.НакладнаяНаОтгрузку = &НакладнаяНаОтгрузку
	               |	И ЛБ_ОбъектыЗалогаПодлежащиеОтгрузке.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	               |	И ЛБ_ОбъектыЗалогаПодлежащиеОтгрузке.Период < &Дата
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ЛБ_ОбъектыЗалогаПодлежащиеОтгрузке.НакладнаяНаОтгрузку,
	               |	ЛБ_ОбъектыЗалогаПодлежащиеОтгрузке.Период
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Период УБЫВ";
	Для каждого Стр Из ТаблицаЗапроса Цикл 
		Запрос.УстановитьПараметр("НакладнаяНаОтгрузку", Стр.НакладнаяНаОтгрузку);
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда  
			Стр.КоличествоИзделий = Выборка.Количество;
			Стр.ВесИзделий = Выборка.Вес;
			Стр.СуммаОценки = Выборка.СуммаОценки;
		КонецЕсли;	
	Конеццикла;	
		
	//Если НЕ ЗначениеЗаполнено(Документ) Тогда 
	//	Запрос.Текст = "ВЫБРАТЬ
	//	               |	ЛБ_СтатусыОбъектовЗалогаВНакладнойСрезПоследних.НакладнаяНаОтгрузку КАК НакладнаяНаОтгрузку,
	//	               |	ЛБ_СтатусыОбъектовЗалогаВНакладнойСрезПоследних.ЗалоговыйБилет КАК ЗалоговыйБилет,
	//	               |	ЛБ_СтатусыОбъектовЗалогаВНакладнойСрезПоследних.ОбъектЗалога КАК ОбъектЗалога,
	//	               |	ЛБ_СтатусыОбъектовЗалогаВНакладнойСрезПоследних.Статус КАК Статус
	//	               |ИЗ
	//	               |	РегистрСведений.ЛБ_СтатусыОбъектовЗалогаВНакладной.СрезПоследних(, НакладнаяНаОтгрузку В (&Список)) КАК ЛБ_СтатусыОбъектовЗалогаВНакладнойСрезПоследних
	//	               |ГДЕ
	//	               |	ЛБ_СтатусыОбъектовЗалогаВНакладнойСрезПоследних.Статус = ЗНАЧЕНИЕ(Перечисление.ЛБ_СтатусыОбъектовЗалогаНакладнойНаОтгрузку.ИсключенИзНакладной)";
	//	ТаблицаСтатусовВНакладной = Запрос.Выполнить().Выгрузить();  
	//	
	//	Для каждого СтрЗ Из ТаблицаЗапроса Цикл 
	//		Для каждого Стр Из СтрЗ.НакладнаяНаОтгрузку.Залоги Цикл
	//			Отбор = Новый Структура;
	//			Отбор.Вставить("НакладнаяНаОтгрузку", СтрЗ.НакладнаяНаОтгрузку);
	//			Отбор.Вставить("ЗалоговыйБилет", Стр.ЗалоговыйБилет);
	//			Отбор.Вставить("ОбъектЗалога", Стр.ОбъектЗалога); 
	//			
	//			Строки = ТаблицаСтатусовВНакладной.НайтиСтроки(Отбор); 
	//			Если НЕ Строки.Количество() = 0 тогда
	//				СтрЗ.КоличествоИзделий = СтрЗ.КоличествоИзделий - Стр.Количество;  
	//				СтрЗ.ВесИзделий = СтрЗ.ВесИзделий - Стр.Вес;
	//				СтрЗ.СуммаОценки = СтрЗ.СуммаОценки - Стр.СуммаОценки;
	//			КонецЕсли	
	//		Конеццикла;	
	//	КонецЦикла; 
	//Иначе         
	Если ЗначениеЗаполнено(Документ) Тогда 
		ТаблицаЗапроса.ЗаполнитьЗначения(Перечисления.ЛБ_статусыНакладнойНаОтгрузку.ПустаяСсылка(), "СтатусНакладнойНовый");
		Запрос.УстановитьПараметр("Регистратор", Документ);
		Запрос.Текст = "ВЫБРАТЬ
		               |	ЛБ_СтатусыНакладнойНаОтгрузку.НакладнаяНаОтгрузку КАК НакладнаяНаОтгрузку,
		               |	ЛБ_СтатусыНакладнойНаОтгрузку.СтатусНакладной КАК СтатусНакладной
		               |ИЗ
		               |	РегистрСведений.ЛБ_СтатусыНакладнойНаОтгрузку КАК ЛБ_СтатусыНакладнойНаОтгрузку
		               |ГДЕ
		               |	ЛБ_СтатусыНакладнойНаОтгрузку.Регистратор = &Регистратор";  
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл 
			Отбор = Новый Структура;
			Отбор.Вставить("НакладнаяНаОтгрузку", Выборка.НакладнаяНаОтгрузку);
			строки = ТаблицаЗапроса.НайтиСтроки(Отбор);
			Для каждого Стр Из Строки Цикл
				Стр.СтатусНакладнойНовый = Выборка.СтатусНакладной;
            Конеццикла;
		КонецЦикла;	
	КонецЕсли;	
	
	ТаблицаВыбора.Загрузить(ТаблицаЗапроса);     
КонецПроцедуры	
	
&НаКлиенте
Процедура ПослеВыбораНакладных(Результат, ДопПараметры) Экспорт
	Если Результат = Неопределено Тогда
	    Возврат;
	КонецЕсли; 
	
	СписокНакладных = Результат; 
	ЗаполнитьТаблицу();  
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьОтгрузку(Команда)       
	СписокНакладныхДляОтмены = Новый СписокЗначений;  
	Для каждого стр Из ТаблицаВыбора Цикл    
		Если Стр.Вкл Тогда 
			СписокНакладныхДляОтмены.Добавить(Стр.НакладнаяНаОтгрузку);
		КонецЕсли;	
	КонецЦикла;	
	Если СписокНакладныхДляОтмены.Количество() = 0 Тогда
		Предупреждение("Не выбраны накладные для отмены отгрузки", 60); 
	Иначе  
		Закрыть(СписокНакладныхДляОтмены);
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
КонецПроцедуры
